app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "I love fooood!"], ["post_id", 1], ["user_id", 4], ["created_at", "2021-10-29 21:19:46.789515"], ["updated_at", "2021-10-29 21:19:46.789515"]]
---
    def create
      @comment = current_user.comments.new(comment_params)

      if @comment.save!