app/controllers/posts_controller.rb

    def create
      @post = current_user.posts.new(post_params)
      if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def show
      @post = Post.find(params[:id])
      @sub = Sub.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def require_user_owns_post!
      return if current_user.posts.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 6], ["LIMIT", 1]]

    def vote(direction)
      @post = Post.find(params[:id])
      @user_vote = @post.user_votes.find_or_initialize_by(user: current_user)

      unless @user_vote.update(value: direction)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "user_votes" SET "value" = $1, "updated_at" = $2 WHERE "user_votes"."id" = $3  [["value", -1], ["updated_at", "2021-10-29 20:39:18.661924"], ["id", 1]]