app/controllers/posts_controller.rb

    def show
      @post = Post.find(params[:id])
      @sub = Sub.find_by(slug: @post.subs.first.slug)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."slug" = $1 LIMIT $2  [["slug", "17"], ["LIMIT", 1]]