app/controllers/subs_controller.rb

    def show
        @sub = Sub.friendly.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @sub = current_user.subs.new(sub_params)

        if @sub.save
---
INSERT INTO "subs" ("moderator_id", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["moderator_id", 4], ["title", "Dogs"], ["description", "Dogs are cool!"], ["created_at", "2021-10-29 21:39:37.315673"], ["updated_at", "2021-10-29 21:39:37.315673"]]

    def update
        @sub = Sub.find(params[:id])

        if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Always hungry!"], ["updated_at", "2021-10-29 00:35:51.972332"], ["id", 1]]